# BuiltInFailures.ToggleViewFailures Class

---
Failures about ToggleView.
SystemObject Autodesk.Revit.DBBuiltInFailuresToggleViewFailures
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public static class ToggleViewFailures

    Public NotInheritable Class ToggleViewFailures

    public ref class ToggleViewFailures abstract sealed

    [<AbstractClassAttribute>]
    [<SealedAttribute>]
    type ToggleViewFailures = class end
The BuiltInFailuresToggleViewFailures type exposes the following members.
| Name| Description
---|---|---
| LoseSavedOrientation|  The stored orientation will be lost.
Top
#### Reference
Autodesk.Revit.DB Namespace